import { section } from "@/types/section";

export const sections: section[] = [
    {
        id: "1",
        title: "Основы JavaScript",
        description: "Давайте изучим основы создания скриптов.",
        lessons: ["1", "2"]
    },
    {
        id: "2",
        title: "Качество кода",
        description: "В этой главе объясняются подходы к написанию кода, которые мы будем использовать в дальнейшем при разработке.",
        lessons: ["3"]
    },
    {
        id: "3",
        title: "Введение",
        description: "Про язык JavaScript и окружение для разработки на нём.",
        lessons: ["15"]
    },
    {
        id: "4",
        title: "HTML: Веб-сайттың қаңқасы мен құрылымы",
        description: "Бұл бөлімде біз веб-әзірлеудің іргетасын қалаймыз. HTML (HyperText Markup Language) - кез келген сайттың «сүйегі». Сіз браузерге ақпаратты қалай көрсету керектігін түсіндіруді үйренесіз.",
        lessons: ["4", "5", "6", "7", "8", "9", "10", "11"]
    },
    {
        id: "5",
        title: "CSS: Дизайн, стиль және визуалды эстетика",
        description: "Егер HTML сайттың қаңқасы болса, CSS (Cascading Style Sheets) — оның «киімі» мен сыртқы келбеті. Бұл бөлімде біз сұрықсыз қара-ақ мәтінді заманауи, түрлі-түсті және тартымды интерфейске айналдырамыз.",
        lessons: ["12", "13", "14"]
    },
];